mystr = "Привіт козаки і козачки"
print(mystr)
# У рядку монжа звертатись до окремих символів за індексмо
# Індексація у рядку починається з нуля
name = "Петро" # індекси 0 1 2 3 4
# [] - оператор індексації - для звертання до індексу рядка
print(name[2]) #виведе "т"

# можна розмістити окремі символи рядка по індексу
#name[0] = "C" #помилки, рядки незмінні

name = "Мальвіна"
print("name = ", name)

#зріз зрядка - отримуємо під рядок поточного рядка
print("name[2:4] = ", name[2:4]) #вирізаємо з 2 індекса по 4 індекс не включно
print("name[0:3] = ", name[0:3]) #вирізаємо з 0 по 3 не включно

name = """Аліса в країні чудес""" # багаторядковий рядок

print("name = ",name)

# конкатонація рядків - об'єднання рядків
testStr = "Привіт! " + name # конкатонація аз допомогою +
print("testStr = ", testStr)

#інтерація по рядку за допомгою циклу for
print("---- Ітерація по рядку :) ----")
name = "Педро"
for char in name:
    print(char)

    #чи входить рядок у підрядок
print('си'in name) # True - данний підрядок є у рядку
print('ка'in name) # False - даного підрядка немає у рядку

print("----Довжина рядка----")
print("len(name) =", len(name)) #довжина рядку
# uppear - перетворення рядку у верхній регістр
# lower - перетворення рядка у нижній регістр
# strip - виидалення пробілів на початку і в кінці рядка
# replace - заміна підрядка на інший підрядок
# split - розбиття рядка на список підрядків за роздільником
 # join - об'єднання списку рядків у один рядок з роздільником
 # find - пошук підрядка у рядку, повертає індекс першого входження або -1 якщо не знайдено
 # startswith - перевірка чи починається рядок з певного підрядка
 # endswith - перевірка чи закінчується рядок певним підрядком



 
